sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
void feedWatchdog() {
#if defined(ESP32)
  esp_task_wdt_reset();
#elif defined(ESP8266)
  ESP.wdtFeed();
#endif
}
// ============================================================


// ارسال پاسخ استاندارد JSON برای همه endpointها
void sendJsonMessage(int code, const char* status, const char* message) {
  StaticJsonDocument<192> doc;
  doc["status"] = status;
  if (message && strlen(message) > 0) doc["message"] = message;

  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  server.send(code, "application/json", out);
}

// خواندن بدنه JSON. همه درخواست‌های تغییردهنده باید application/json و body معتبر داشته باشند.
bool parseJsonBody(JsonDocument &doc) {
  if (!server.hasArg("plain")) {
    sendJsonMessage(400, "error", "Missing JSON body");
    return false;
  }
  DeserializationError error = deserializeJson(doc, server.arg("plain"));
  if (error) {
    sendJsonMessage(400, "error", "Invalid JSON");
    return false;
  }
  return true;
}

// تابع کمکی برای سوئیچ کردن رله بر اساس منطق (Active-Low یا Active-High)
void setRelay(bool state) {
  if (state) {
    digitalWrite(RELAY_PIN, RELAY_ACTIVE_LEVEL);
  } else {
    digitalWrite(RELAY_PIN, !RELAY_ACTIVE_LEVEL);
  }
}

// ============================================================
//  چرخه‌ی روشن/خاموش دوره‌ای AP + کنترل قدرت سیگنال رادیو وای‌فای
// ============================================================

// اعمال سطح قدرت سیگنال انتخاب‌شده روی رادیوی وای‌فای برد.
// نکته مهم: در ESP32 این تنظیم روی کل رادیو اعمال می‌شود (هم AP هم STA)، چون فقط یک رادیوی
// فیزیکی مشترک وجود دارد؛ تفکیک جداگانه‌ی توان برای AP و STA در سخت‌افزار ESP32 ممکن نیست.
void applyApTxPower() {
#if defined(ESP32)
  wifi_power_t p;
  switch (apTxPowerLevel) {
    case 0:  p = WIFI_POWER_5dBm;    break;
    case 1:  p = WIFI_POWER_11dBm;   break;
    case 2:  p = WIFI_POWER_15dBm;   break;
    default: p = WIFI_POWER_19_5dBm; break;
  }
  WiFi.setTxPower(p);
  Serial.print("TX Power set to level "); Serial.print(apTxPowerLevel);
  Serial.print(" -> requested="); Serial.print((int)p);
  Serial.print(" actual="); Serial.println((int)WiFi.getTxPower());
#elif defined(ESP8266)
  float dbm;
  switch (apTxPowerLevel) {
    case 0:  dbm = 5.0f;  break;
    case 1:  dbm = 11.0f; break;
    case 2:  dbm = 15.0f; break;
    default: dbm = 20.5f; break;
  }
  WiFi.setOutputPower(dbm);
  Serial.print("TX Power set to level "); Serial.print(apTxPowerLevel);
  Serial.print(" -> "); Serial.print(dbm); Serial.println(" dBm");
#endif
}

// روشن/خاموش کردن واقعی رادیوی AP. خاموش کردن با پارامتر true به softAPdisconnect باعث می‌شود
// AP کاملاً از حالت پخش خارج شود (نه فقط قطع کلاینت‌ها)، و دوباره فراخوانی softAP آن را برمی‌گرداند.
// اتصال STA (اینترنت) و تمام منطق رله/سناریو/ساعت کاملاً مستقل از این وضعیت باقی می‌ماند.
void setApRadioState(bool on) {
  if (on == apCurrentlyOn) return;
  if (on) {
    WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
    applyApTxPower();
  } else {
    WiFi.softAPdisconnect(true);
  }
  apCurrentlyOn = on;
}

// مدیریت چرخه‌ی دوره‌ای AP در loop(). اگر چرخه غیرفعال باشد، فقط مطمئن می‌شویم AP روشن بماند
// (حالت عادی/فعلی برنامه). اگر فعال باشد، بین بازه‌ی روشن و خاموش بر اساس تنظیمات کاربر جابه‌جا می‌شود.
// نکته مهم: تا وقتی حداقل یک گوشی/دستگاه به AP وصل است، تایمر چرخه اصلاً پیش نمی‌رود و AP خاموش
// نمی‌شود؛ فقط بعد از قطع شدن آخرین دستگاه، شمارش مدت «روشن» از نو شروع می‌شود.
void manageApCycle() {
  if (!apCycleEnabled) {
    if (!apCurrentlyOn) {
      setApRadioState(true);
      apCycleLastToggleMillis = millis();
    }
    return;
  }

  // اگر همین الان حداقل یک کلاینت (گوشی/دستگاه) به AP وصل است، چرخه کاملاً متوقف می‌ماند:
  // AP روشن نگه داشته می‌شود و لحظه‌ی شروع شمارش هر بار به «همین الان» به‌روزرسانی می‌شود تا
  // به محض قطع شدن آخرین دستگاه، بازه‌ی «روشن» با شمارش کامل از نو آغاز شود.
  if (apCurrentlyOn && WiFi.softAPgetStationNum() > 0) {
    apCycleLastToggleMillis = millis();
    return;
  }

  unsigned long onMs  = (unsigned long)apOnMinutes  * 60000UL;
  unsigned long offMs = (unsigned long)apOffMinutes * 60000UL;
  unsigned long elapsed = millis() - apCycleLastToggleMillis;

  if (apCurrentlyOn && elapsed >= onMs) {
    setApRadioState(false);
    apCycleLastToggleMillis = millis();
  } else if (!apCurrentlyOn && elapsed >= offMs) {
    setApRadioState(true);
    apCycleLastToggleMillis = millis();
  }
}

// ============================================================
//  توابع رمزنگاری سخت‌افزاری (AES) مختص ESP32
// ============================================================

// رمزنگاری/رمزگشایی یک بلوک ۱۶ بایتی AES-128 به صورت ECB.
// ESP32: mbedTLS. ESP8266: BearSSL. خروجی هر دو یکسان است تا فرمت ENC:HEX حفظ شود.
void aesEncryptBlock16(const unsigned char* input, unsigned char* output) {
#if defined(ESP32)
  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, AES_KEY, 128);
  mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, input, output);
  mbedtls_aes_free(&aes);
#elif defined(ESP8266)
  // در ESP8266 بعضی نسخه‌های BearSSL توابع داخلی br_aes_big_keysched/br_aes_big_encrypt
  // را public نمی‌کنند. برای سازگاری با Arduino-ESP8266 Core از API عمومی CBC استفاده می‌کنیم.
  // چون هر بار فقط یک بلوک ۱۶ بایتی با IV صفر پردازش می‌شود، خروجی دقیقاً معادل ECB است.
  memcpy(output, input, 16);
  unsigned char iv[16] = {0};
  br_aes_big_cbcenc_keys ctx;
  br_aes_big_cbcenc_init(&ctx, AES_KEY, 16);
  br_aes_big_cbcenc_run(&ctx, iv, output, 16);
#endif
}

void aesDecryptBlock16(const unsigned char* input, unsigned char* output) {
#if defined(ESP32)
  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_dec(&aes, AES_KEY, 128);
  mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, input, output);
  mbedtls_aes_free(&aes);
#elif defined(ESP8266)
  // معادل ECB decrypt با CBC decrypt روی یک بلوک و IV صفر.
  memcpy(output, input, 16);
  unsigned char iv[16] = {0};
  br_aes_big_cbcdec_keys ctx;
  br_aes_big_cbcdec_init(&ctx, AES_KEY, 16);
  br_aes_big_cbcdec_run(&ctx, iv, output, 16);
#endif
}

// این تابع متن ساده رمز را می‌گیرد و به یک رشته رمزگذاری‌شده (تبدیل شده به هگز) برمی‌گرداند.
String encryptPassword(const char* password, size_t bufferSize) {
  if (strlen(password) == 0) return "";

  size_t paddedSize = (bufferSize + 15) / 16 * 16;
  unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
  if (!input) return "";
  strncpy((char*)input, password, bufferSize - 1);

  unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
  if (!output) {
    free(input);
    return "";
  }

  for (size_t i = 0; i < paddedSize; i += 16) {
    aesEncryptBlock16(input + i, output + i);
    feedWatchdog();
  }

  String hexString = "ENC:";
  hexString.reserve(4 + paddedSize * 2);
  for (size_t i = 0; i < paddedSize; i++) {
    char hex[3];
    sprintf(hex, "%02x", output[i]);
    hexString += String(hex);
  }

  free(input);
  free(output);
  return hexString;
}

// این تابع مقادیر را از فایل می‌خواند و در صورتی که رمز شده باشد باز می‌کند.
// اگر تنظیمات از قبل (نسخه قدیمی) به صورت متن ساده ذخیره شده باشد، هوشمندانه آن را می‌فهمد.
void loadAndDecryptPassword(const char* savedValue, char* outputBuffer, size_t bufferSize) {
  String val = String(savedValue);

  if (val.length() == 0) {
    outputBuffer[0] = '\0';
    return;
  }

  if (val.startsWith("ENC:")) {
    String hexString = val.substring(4);
    size_t len = hexString.length();
    if (len % 32 != 0) {
      outputBuffer[0] = '\0';
      return;
    }

    size_t paddedSize = len / 2;
    unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
    if (!input) {
      outputBuffer[0] = '\0';
      return;
    }

    for (size_t i = 0; i < paddedSize; i++) {
      char hex[3] = {hexString[i * 2], hexString[i * 2 + 1], '\0'};
      input[i] = (unsigned char)strtol(hex, NULL, 16);
    }

    unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
    if (!output) {
      free(input);
      outputBuffer[0] = '\0';
      return;
    }

    for (size_t i = 0; i < paddedSize; i += 16) {
      aesDecryptBlock16(input + i, output + i);
      feedWatchdog();
    }

