sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
    size_t copySize = paddedSize < bufferSize ? paddedSize : bufferSize - 1;
    memcpy(outputBuffer, output, copySize);
    outputBuffer[copySize] = '\0';

    free(input);
    free(output);
  } else {
    strncpy(outputBuffer, savedValue, bufferSize - 1);
    outputBuffer[bufferSize - 1] = '\0';
  }
}

void setup() {
  // راه‌اندازی سریال در ESP32؛ پایه رله از RX0 جدا شده تا تداخل سریال ایجاد نشود
  Serial.begin(115200);
  
  // فعال‌سازی واچ‌داگ مخصوص ESP32 با تایم‌اوت ۸ ثانیه
  setupWatchdog(); 

  // راه‌اندازی حافظه داخلی سیستم
#if defined(ESP32)
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS Mount Failed even after formatting!");
  }
#elif defined(ESP8266)
  if (!LittleFS.begin()) {
    Serial.println("LittleFS Mount Failed. Formatting...");
    LittleFS.format();
    if (!LittleFS.begin()) Serial.println("LittleFS Mount Failed even after formatting!");
  }
#endif

  // لود کردن تنظیمات ذخیره شده
  loadScenarios();
  loadWiFiSettings(); // در این بخش رمزها خودکار رمزگشایی می‌شوند
  loadOverrideSetting(); // لود کردن وضعیت دستی
  loadProtectionSettings(); // لود کردن محافظت ضد روشن/خاموش شدن سریع
  loadTimeSetting();     
  loadRelayStats();      // لود کردن آمار سوییچ/مدت‌کارکرد رله ذخیره شده
  loadNtpSuccessInfo();  // لود کردن آخرین دریافت موفق ساعت از اینترنت

  // تنظیم پین رله
  pinMode(RELAY_PIN, OUTPUT);

  // *** اعمال فوری وضعیت کلید دستی بلافاصله پس از راه‌اندازی ***
  // در صورتی که قبل از قطعی برق رله روی حالت دستی روشن بوده، دوباره بی‌قید و شرط روشن می‌ماند
  if (manual_override == 1) {
    setRelay(true);
  } else {
    setRelay(false);
  }

  // *** هماهنگ کردن آمار رله با وضعیت واقعی سخت‌افزار بلافاصله بعد از بوت ***
  // مهم: اگر رله از قبل (قبل از این ریست/قطعی برق) روشن بوده و همچنان روشن می‌ماند، این ادامه‌ی همان
  // دوره‌ی کارکرد کمپرسور است، نه یک سوییچ جدید؛ پس این را در lastRelayStatState بدون افزایش شمارنده
  // ثبت می‌کنیم تا اولین بررسی در checkScenarios() آن را به اشتباه یک «سوییچ جدید» حساب نکند.
  lastRelayStatState = (manual_override == 1) ? 1 : 0;
  // بعد از بوت، اگر رله خاموش است یک دوره‌ی محافظه‌کارانه شروع می‌شود؛ چون وضعیت واقعی
  // کمپرسور درست پیش از قطع برق قابل اعتماد نیست.
  if (lastRelayStatState == 0) lastRelayOffMillis = millis();
  if (lastRelayStatState == 1) {
    relayOnSinceMillis = millis();
    relayCurrentlyOnForStats = true;
  }
  // مهم: تایمر ذخیره دوره‌ای آمار را هم‌زمان با بوت مقداردهی کن تا اگر رله از بوت روشن بود،
  // اختلاف از صفر millis حساب نشود و عدد پرت به onSeconds اضافه نشود.
  lastRelayStatSaveMillis = millis();

  // راه‌اندازی وای‌فای به صورت همزمان: AP برای اتصال مستقیم گوشی + STA برای اتصال اختیاری به اینترنت
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(false);              // جلوگیری از نوشتن بی‌مورد تنظیمات وای‌فای روی فلش داخلی ESP32
  WiFi.setAutoReconnect(true);         // در فاز روشنِ STA اگر اتصال به مودم قطع شد، خود برد دوباره تلاش کند
  WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
  applyApTxPower();      // اعمال سطح قدرت سیگنال ذخیره‌شده (یا پیش‌فرض حداکثر)
  apCurrentlyOn = true;
  apCycleLastToggleMillis = millis();
  Serial.println("Access Point Started");

  // آغاز فاز اولیهٔ اتصال STA. اگر اینترنت فعال و تنظیمات مودم موجود باشد، اتصال برقرار می‌شود؛
  // در غیر این صورت STA خاموش می‌ماند تا بعداً از پنل فعال شود.
  staCurrentlyOn = true;
  staCycleLastToggleMillis = millis();
  connectToInternetWiFi();

  // تعریف کنترل‌کننده‌های وب‌سرور
  server.on("/", HTTP_GET, handleApiRoot);
  server.on("/settings", HTTP_GET, handleGetSettings);
  server.on("/save", HTTP_POST, handleSaveScenario);
  server.on("/sync", HTTP_POST, handleSyncTime);
  server.on("/status", HTTP_GET, handleGetStatus);
  server.on("/toggle-manual", HTTP_POST, handleToggleManual);
  server.on("/save-ap", HTTP_POST, handleSaveAP);
  server.on("/save-sta", HTTP_POST, handleSaveSTA);
  server.on("/save-protection", HTTP_POST, handleSaveProtection);
  server.on("/save-ap-cycle", HTTP_POST, handleSaveApCycle);
  server.on("/factory-reset", HTTP_POST, handleFactoryReset);

  server.onNotFound([](){
    if (server.method() == HTTP_OPTIONS) {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.sendHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
      server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
      server.send(204);
      return;
    }
    sendJsonMessage(404, "error", "Endpoint not found");
  });

  server.begin();
  lastTick = millis();
  lastTimeSaveMillis = millis();
}

void loop() {
  feedWatchdog();

  // ============================================================
  //  زمان‌بندی چندوظیفه‌ای سبک و قابل‌حمل برای ESP32 و ESP8266
  // ============================================================
  // ESP8266-01 تک‌هسته‌ای است و FreeRTOS واقعی ندارد؛ بنابراین «مولتی‌ترد واقعی» روی هر دو برد
  // به شکل یکسان ممکن نیست. برای اینکه رفتار روی ESP32 و ESP8266 یکی بماند، کارها به taskهای
  // کوتاه و غیرمسدودکننده تقسیم شده‌اند تا وب‌سرور، ساعت، رله، NTP و چرخه‌های WiFi همزمان و روان‌تر
  // جلو بروند. روی ESP32 هم این روش عمداً حفظ شده تا منطق مشترک بماند و race condition ایجاد نشود.

  const unsigned long now = millis();

  // وب‌سرور باید در هر دور loop سرویس بگیرد تا API کند نشود.
  server.handleClient();

  // ساعت داخلی همچنان با while جبران عقب‌افتادگی می‌کند و باید خیلی مکرر اجرا شود.
  updateClock();

  // مدیریت ریستارت نرم‌افزاری امن
  if (pendingReset && (now - resetMillis > 2000UL)) {
    if (!pendingFactoryReset) saveTimeSetting();
    ESP.restart();
  }

  // بررسی کمبود RAM، اما نه در هر میکروثانیه؛ هر ۱ ثانیه کافی است و روی ESP8266 هم فشار کمتر دارد.
  static unsigned long lastHeapCheck = 0;
  static int lowHeapStreak = 0;
  if (now - lastHeapCheck >= 1000UL) {
    lastHeapCheck = now;
    if (ESP.getFreeHeap() < 2000) {
      lowHeapStreak++;
      if (lowHeapStreak >= 5) {
        Serial.println("Memory too low! Restarting safely to prevent freeze.");
        saveTimeSetting();
        ESP.restart();
      }
    } else {
      lowHeapStreak = 0;
    }
  }

  // سناریوها و رله: رزولوشن برنامه دقیقه‌ای است؛ ۲۰۰ms کاملاً کافی و بسیار سبک‌تر از هر loop است.
  static unsigned long lastScenarioTask = 0;
  if (now - lastScenarioTask >= 200UL) {
    lastScenarioTask = now;
    checkScenarios();
  }

