sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
  // کارهای WiFi/NTP/AP دوره‌ای هستند و لازم نیست در هر loop اجرا شوند.
  static unsigned long lastNetworkTask = 0;
  if (now - lastNetworkTask >= 1000UL) {
    lastNetworkTask = now;
    manageStaCycle();
    tryNtpSync();
    manageApCycle();
  }

  // ذخیره پشتیبان دوره‌ای زمان.
  if (time_synchronized && (now - lastTimeSaveMillis >= TIME_SAVE_INTERVAL)) {
    saveTimeSetting();
  }

  // ذخیره پیشرفت دوره‌ی جاری «روشن بودن» رله.
  if (relayCurrentlyOnForStats && (now - lastRelayStatSaveMillis >= TIME_SAVE_INTERVAL)) {
    unsigned long elapsedSec = relayCurrentPeriodElapsedSeconds();
    if (elapsedSec > 0) {
      addRelayOnSecondsSafely(elapsedSec);
      relayOnSinceMillis = millis();
    } else {
      relayOnSinceMillis = millis();
    }
    saveRelayStats();
  }

  // محافظت در برابر بازنشانی خاموش/بی‌صدای قدرت سیگنال توسط استک وای‌فای.
  static unsigned long lastTxPowerRefresh = 0;
  if (now - lastTxPowerRefresh >= 30000UL) {
    applyApTxPower();
    lastTxPowerRefresh = now;
  }

  // محافظت اضافه در برابر نویز رله (EMI): جهت پین رله هر ۳۰ ثانیه refresh می‌شود.
  static unsigned long lastPinModeRefresh = 0;
  if (now - lastPinModeRefresh >= 30000UL) {
    pinMode(RELAY_PIN, OUTPUT);
    lastPinModeRefresh = now;
  }

  // در ESP8266 این yield برای WiFi stack حیاتی است؛ در ESP32 هم بی‌ضرر است.
  yield();
}

void updateClock() {
  // از while به‌جای if استفاده شده: اگر loop() به هر دلیلی (نوشتن روی فلش، تاخیر وای‌فای و ...)
  // بیش از ۱ ثانیه بلاک شود، ساعت باید همان لحظه جبران شود، نه اینکه طی چند اجرای بعدی loop()
  // به‌تدریج جمع شود.
  while (millis() - lastTick >= 1000) {
    lastTick += 1000;
    currentSecond++;
    if (currentSecond >= 60) {
      currentSecond = 0;
      currentMinute++;
      if (currentMinute >= 60) {
        currentMinute = 0;
        currentHour++;
        if (currentHour >= 24) {
          currentHour = 0;
          advanceDate();
        }
      }
    }
  }
}

bool isLeapYear(int year) { return (year % 4 == 0 && year % 100 != 0) || (year % 400 == 0); }

void advanceDate() {
  const int daysInMonth[] = {31,28,31,30,31,30,31,31,30,31,30,31};
  int maxDay = daysInMonth[currentMonth - 1];
  if (currentMonth == 2 && isLeapYear(currentYear)) maxDay = 29;
  currentDay++;
  if (currentDay > maxDay) { currentDay = 1; currentMonth++; if (currentMonth > 12) { currentMonth = 1; currentYear++; } }
  currentWeekday = (currentWeekday + 1) % 7;
}

void checkScenarios() {
  // جلوگیری از ذخیره‌سازی/لاگ بی‌دلیل با کش کردن وضعیت منطقی قبلی
  static int lastKnownState = -1; 
  bool desiredState;

  // اگر کنترل دستی روشن است، هیچ سناریویی بررسی نمی‌شود
  if (manual_override == 1) {
    desiredState = true;
    if (lastKnownState != 1) {
      if (time_synchronized) saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
      lastKnownState = 1;
    }
  }
  // اگر پس از قطع برق هنوز ساعت همگام‌سازی نشده باشد، رله خاموش می‌ماند
  else if (!time_synchronized) {
    desiredState = false;
    if (lastKnownState != 0) {
      lastKnownState = 0;
    }
  }
  else {
    desiredState = false;
    int currentMinutesSinceMidnight = currentHour * 60 + currentMinute;

    for (int i = 0; i < MAX_SCENARIOS; i++) {
      // سناریوی حذف‌شده یا غیرفعال فقط نمایش داده/ذخیره می‌شود و اجرا نمی‌شود
      if (!scenarios[i].active || !scenarios[i].enabled) continue;

      int startMinutes = scenarios[i].startHour * 60 + scenarios[i].startMinute;
      int endMinutes = scenarios[i].endHour * 60 + scenarios[i].endMinute;
      uint8_t selectedDays = scenarios[i].weekdays;

      if (startMinutes == endMinutes || selectedDays == 0) continue;
      // در سناریوی عبور از نیمه‌شب، بخش بعد از نیمه‌شب متعلق به روز شروع سناریو است.
      int scenarioDay = currentWeekday;
      if (startMinutes > endMinutes && currentMinutesSinceMidnight < endMinutes) scenarioDay = (currentWeekday + 6) % 7;
      if ((selectedDays & (1 << scenarioDay)) == 0) continue;

      if (startMinutes < endMinutes) {
        if (currentMinutesSinceMidnight >= startMinutes && currentMinutesSinceMidnight < endMinutes) {
          desiredState = true;
          break;
        }
      } else {
        if (currentMinutesSinceMidnight >= startMinutes || currentMinutesSinceMidnight < endMinutes) {
          desiredState = true;
          break;
        }
      }
    }

    int newKnownState = desiredState ? 1 : 0;
    if (lastKnownState != newKnownState) {
      saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
      lastKnownState = newKnownState;
    }
  }

  // --- محافظت در برابر نویز رله مجاور (EMI) ---
  // پین رله در هر اجرای loop() دوباره نوشته می‌شود، نه فقط زمانی که وضعیت منطقی عوض شده باشد.
  // دلیل: اگر نویز الکتریکی حاصل از قطع/وصل رله کناری باعث برگشتن اتفاقی رجیستر خروجی GPIO شود،
  // قبلاً چون فقط با تغییر lastKnownState دوباره digitalWrite زده می‌شد، فریمور متوجه این "پرش" پین
  // نمی‌شد و رله تا تغییر منطقی بعدی در وضعیت غلط می‌ماند. دیگیتال‌رایت هزینه‌ی محاسباتی ناچیزی دارد،
  // پس نوشتن مکرر آن هیچ ضرری ندارد ولی از ماندگاری اثر نویز روی پین جلوگیری می‌کند.
  // توجه: ذخیره‌سازی فلش (saveTimeSetting) و لاگ فقط روی تغییر واقعی state انجام می‌شود، نه هر بار.

  // --- Anti Short-Cycle Protection ---
  // هر فرمان روشن‌شدن، از جمله حالت دستی، تا سپری‌شدن حداقل زمان خاموشی نگه داشته می‌شود.
  if (desiredState && antiShortCycleMinutes > 0 && lastRelayStatState == 0) {
    unsigned long requiredMs = (unsigned long)antiShortCycleMinutes * 60UL * 1000UL;
    if (millis() - lastRelayOffMillis < requiredMs) desiredState = false;
  }

  // --- آمار سوییچ و مدت‌کارکرد رله (برای پایش سلامت/عمر کمپرسور) ---
  // این بخش کاملاً جدا از lastKnownState بالا کار می‌کند تا به منطق اصلی سناریو/دستی دست زده نشود؛
  // فقط تغییر واقعی وضعیت خروجی رله را (فارغ از دلیل: سناریو یا دستی) برای آمار ثبت می‌کند.
  int newRelayStatState = desiredState ? 1 : 0;
  if (lastRelayStatState != newRelayStatState) {
    if (newRelayStatState == 1) {
      // کمپرسور تازه روشن شد: یک سوییچ جدید و شروع اندازه‌گیری این دوره
      relaySwitchCount++;
      relayOnSinceMillis = millis();
      relayCurrentlyOnForStats = true;
    } else {
      // کمپرسور تازه خاموش شد: مدت این دوره به مجموع اضافه می‌شود
      if (relayCurrentlyOnForStats) {
        addRelayOnSecondsSafely(relayCurrentPeriodElapsedSeconds());
      }
      relayCurrentlyOnForStats = false;
      lastRelayOffMillis = millis();
    }
    lastRelayStatState = newRelayStatState;
    saveRelayStats(); // ذخیره فوری هر رویداد واقعی سوییچ، مشابه ذخیره فوری ساعت قبل از فرمان رله
  }

  setRelay(desiredState);
}

