sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
void loadScenarios() {
  if (!LittleFS.exists("/scenarios.json")) return;
  
  File configFile = LittleFS.open("/scenarios.json", "r");
  if (!configFile) return;

  // تغییر به DynamicJsonDocument برای جلوگیری از Stack Overflow
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  DeserializationError error = deserializeJson(doc, configFile);
  configFile.close();

  if (error) {
    Serial.print("loadScenarios JSON error: ");
    Serial.println(error.c_str());
    return;
  }

  // Migration سناریوها: نسخه ۱ آرایهٔ مستقیم بود؛ نسخه ۲ یک شیء شامل version و items است.
  JsonArray array = doc.is<JsonArray>() ? doc.as<JsonArray>() : doc["items"].as<JsonArray>();
  int i = 0;
  for (JsonObject v : array) {
    if (i >= MAX_SCENARIOS) break;
    bool itemActive = v["active"] | false;
    scenarios[i].active = itemActive;
    // برای سازگاری با فایل‌های قدیمی: اگر کلید en وجود نداشت، سناریوهای موجود فعال فرض می‌شوند
    scenarios[i].enabled = v.containsKey("en") ? (bool)v["en"] : itemActive;
    scenarios[i].startHour = v["sh"] | 0;
    scenarios[i].startMinute = v["sm"] | 0;
    scenarios[i].endHour = v["eh"] | 0;
    scenarios[i].endMinute = v["em"] | 0;
    // سازگاری با سناریوهای قدیمی: نبودن wd یعنی اجرا در تمام روزها
    scenarios[i].weekdays = v.containsKey("wd") ? (uint8_t)(v["wd"] | 0x7F) : 0x7F;
    i++;
  }
}

void saveScenarios() {
  // تغییر به DynamicJsonDocument برای جلوگیری از Stack Overflow
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  JsonObject root = doc.to<JsonObject>();
  root["version"] = SCENARIOS_FILE_VERSION;
  JsonArray array = root.createNestedArray("items");
  
  for (int i = 0; i < MAX_SCENARIOS; i++) {
    JsonObject obj = array.createNestedObject();
    obj["active"] = scenarios[i].active;
    obj["en"] = scenarios[i].enabled; // فعال بودن اجرای سناریو، جدا از حذف شدن آن
    obj["sh"] = scenarios[i].startHour;
    obj["sm"] = scenarios[i].startMinute;
    obj["eh"] = scenarios[i].endHour;
    obj["em"] = scenarios[i].endMinute;
    obj["wd"] = scenarios[i].weekdays;
  }

  File configFile = LittleFS.open("/scenarios.json", "w");
  if (!configFile) return;
  size_t written = serializeJson(doc, configFile);
  configFile.close();

  // اگر چیزی نوشته نشد یعنی فلش پر بوده یا خرابی رخ داده؛ فایل خراب را حذف می‌کنیم
  // تا در بوت بعدی به‌جای دیتای ناقص، به‌درستی رد شود.
  if (written == 0) {
    Serial.println("saveScenarios write failed!");
    LittleFS.remove("/scenarios.json");
  }
}

void loadWiFiSettings() {
  if (!LittleFS.exists("/wifi.json")) return;
  
  File configFile = LittleFS.open("/wifi.json", "r");
  if (!configFile) return;

  // بافر به دلیل تبدیل متن به هگزادسیمال رمزنگاری‌شده افزایش یافته است
  StaticJsonDocument<1024> doc;
  DeserializationError error = deserializeJson(doc, configFile);
  configFile.close();

  if (error) return;
  // wifi.json نسخهٔ ۱ فاقد کلید version بود؛ هر دو فرمت همچنان خوانده می‌شوند.

  if (doc.containsKey("ssid")) { strncpy(custom_ssid, doc["ssid"], 31); custom_ssid[31] = '\0'; }
  if (doc.containsKey("pass")) {
    // بارگذاری و رمزگشایی هوشمند رمز عبور فرستنده (AP)
    loadAndDecryptPassword(doc["pass"], custom_password, 32);
  }
  if (doc.containsKey("sta_ssid")) { strncpy(sta_ssid, doc["sta_ssid"], 31); sta_ssid[31] = '\0'; }
  if (doc.containsKey("sta_pass")) {
    // بارگذاری و رمزگشایی هوشمند رمز عبور اینترنت (STA)
    loadAndDecryptPassword(doc["sta_pass"], sta_password, 64);
  }

  // در نسخه‌های جدید فقط همین کلید تعیین می‌کند که اصلاً از مودم/اینترنت استفاده شود یا نه.
  if (doc.containsKey("internet")) { internet_enabled = doc["internet"] | true; }

  // مهاجرت از نسخهٔ ۴: اگر کاربر قبلاً کلید جداگانهٔ STA را خاموش کرده بود و هنوز فیلدهای جدید چرخه وجود ندارند،
  // همان رفتار به «اینترنت غیرفعال» تبدیل می‌شود تا انتخاب قبلی کاربر از بین نرود.
  if (doc.containsKey("staEnabled") && !doc.containsKey("staOnMinutes") && !doc.containsKey("staOffMinutes")) {
    bool legacyStaEnabled = doc["staEnabled"] | true;
    if (!legacyStaEnabled) internet_enabled = false;
  }

  if (doc.containsKey("staOnMinutes")) {
    int v = doc["staOnMinutes"] | staOnMinutes;
    staOnMinutes = constrain(v, MIN_STA_ON_MINUTES, MAX_STA_CYCLE_MINUTES);
  }
  if (doc.containsKey("staOffMinutes")) {
    int v = doc["staOffMinutes"] | staOffMinutes;
    staOffMinutes = constrain(v, MIN_STA_OFF_MINUTES, MAX_STA_CYCLE_MINUTES);
  }

  // فیلدهای نسخه ۳: چرخه‌ی AP و قدرت سیگنال. فایل‌های قدیمی‌تر (نسخه ۲ و پایین‌تر) فاقد این کلیدها هستند
  // و به همین دلیل مقدار پیش‌فرض تعریف‌شده در بالای برنامه (چرخه غیرفعال، توان حداکثر) حفظ می‌شود.
  if (doc.containsKey("apCycleEnabled")) { apCycleEnabled = doc["apCycleEnabled"] | false; }
  if (doc.containsKey("apOnMinutes")) {
    int v = doc["apOnMinutes"] | apOnMinutes;
    apOnMinutes = constrain(v, MIN_AP_CYCLE_MINUTES, MAX_AP_CYCLE_MINUTES);
  }
  if (doc.containsKey("apOffMinutes")) {
    int v = doc["apOffMinutes"] | apOffMinutes;
    apOffMinutes = constrain(v, MIN_AP_CYCLE_MINUTES, MAX_AP_CYCLE_MINUTES);
  }
  if (doc.containsKey("apTxPowerLevel")) {
    int v = doc["apTxPowerLevel"] | apTxPowerLevel;
    apTxPowerLevel = constrain(v, 0, MAX_AP_TX_POWER_LEVEL);
  }
}

void saveWiFiSettings() {
  StaticJsonDocument<1024> doc;
  doc["version"] = WIFI_FILE_VERSION;
  doc["ssid"] = custom_ssid;
  
  // اعمال رمزنگاری سخت‌افزاری بر روی پسورد شبکه محلی بورد
  doc["pass"] = encryptPassword(custom_password, 32);
  
  doc["sta_ssid"] = sta_ssid;
  
  // اعمال رمزنگاری سخت‌افزاری بر روی پسورد مودم کاربر قبل از نگارش در فلش مموری بورد
  doc["sta_pass"] = encryptPassword(sta_password, 64);
  
  doc["internet"] = internet_enabled;
  doc["staOnMinutes"] = staOnMinutes;
  doc["staOffMinutes"] = staOffMinutes;

  doc["apCycleEnabled"] = apCycleEnabled;
  doc["apOnMinutes"] = apOnMinutes;
  doc["apOffMinutes"] = apOffMinutes;
  doc["apTxPowerLevel"] = apTxPowerLevel;

  File configFile = LittleFS.open("/wifi.json", "w");
  if (!configFile) return;
  size_t written = serializeJson(doc, configFile);
  configFile.close();

  // مطابق همان الگوی محافظتی سایر توابع ذخیره‌سازی (saveScenarios/saveTimeSetting/...):
  // اگر نوشتن ناقص بود (مثلاً فلش پر بود)، فایل نیمه‌نوشته را حذف می‌کنیم تا در بوت بعدی
  // به‌جای خواندن دیتای خراب (که می‌تواند شامل SSID/رمز رمزنگاری‌شده باشد)، به‌درستی رد شود.
  if (written == 0) {
    Serial.println("saveWiFiSettings write failed!");
    LittleFS.remove("/wifi.json");
  }
}

void loadOverrideSetting() {
  if (!LittleFS.exists("/override.txt")) {
    manual_override = 0;
    return;
  }
  File f = LittleFS.open("/override.txt", "r");
  if (f) {
    String val = f.readString();
    // سازگاری با فایل قدیمی که فقط 0 یا 1 بود.
    manual_override = val.startsWith("V") ? val.substring(val.indexOf(':') + 1).toInt() : val.toInt();
    manual_override = (manual_override == 1) ? 1 : 0;
    f.close();
  }
}

void saveOverrideSetting() {
  File f = LittleFS.open("/override.txt", "w");
  if (f) {
    f.print("V"); f.print(OVERRIDE_FILE_VERSION); f.print(":"); f.print(manual_override);
    f.close();
  }
}

// تنظیمات محافظ ضد استارت مکرر جدا از Wi-Fi نگهداری می‌شود تا توسعه‌ی آینده مستقل باشد.
void loadProtectionSettings() {
  if (!LittleFS.exists("/protection.json")) return;
  File f = LittleFS.open("/protection.json", "r"); if (!f) return;
  StaticJsonDocument<128> doc; DeserializationError err = deserializeJson(doc, f); f.close();
  if (!err && doc.containsKey("minOffMinutes")) {
    int value = doc["minOffMinutes"] | 3;
    antiShortCycleMinutes = constrain(value, 0, MAX_ANTI_SHORT_CYCLE_MINUTES);
  }
}
void saveProtectionSettings() {
  StaticJsonDocument<128> doc;
  doc["version"] = PROTECTION_FILE_VERSION; doc["minOffMinutes"] = antiShortCycleMinutes;
  File f = LittleFS.open("/protection.json", "w"); if (!f) return;
  size_t written = serializeJson(doc, f); f.close();
  // مطابق همان الگوی محافظتی سایر توابع ذخیره‌سازی: نوشتن ناقص را با حذف فایل خراب مشخص می‌کنیم.
  if (written == 0) {
    Serial.println("saveProtectionSettings write failed!");
    LittleFS.remove("/protection.json");
  }
}

// نوشتن مقدار فعلی ساعت روی یکی از دو فایل به نوبت (Round-Robin)
// این کار باعث می‌شود اگر برق درست حین نوشتن قطع شود، نسخه ذخیره شده در فایل دیگر (که دست نخورده مانده) در دسترس بماند
void saveTimeSetting() {
  timeSaveSeq++;
  timeFileSlot = 1 - timeFileSlot; // جابجایی بین فایل ۰ و ۱

  File f = LittleFS.open(TIME_FILES[timeFileSlot], "w");
  if (f) {
    size_t written = f.printf("V%d:%d:%d:%d:%d:%lu:%d:%d:%d:%d", TIME_FILE_VERSION, currentHour, currentMinute, currentSecond, time_synchronized ? 1 : 0, timeSaveSeq, currentYear, currentMonth, currentDay, currentWeekday);
    f.close();
    // اگر نوشتن ناقص بود، این فایل را حذف می‌کنیم تا readTimeFile آن را نامعتبر تشخیص دهد
    // و به‌جای یک رکورد خراب، سراغ فایل زوجش (که سالم مانده) برود.
    if (written == 0) {
      Serial.println("saveTimeSetting write failed!");
      LittleFS.remove(TIME_FILES[timeFileSlot]);
    }
  }
  lastTimeSaveMillis = millis();
}

// خواندن و اعتبارسنجی یکی از دو فایل زمان. در صورت معتبر بودن مقادیر، true برمی‌گرداند
bool readTimeFile(const char* path, int &h, int &m, int &s, int &sync, unsigned long &seq, int &y, int &mon, int &d, int &wd) {
  if (!LittleFS.exists(path)) return false;

  File f = LittleFS.open(path, "r");
  if (!f) return false;

  String val = f.readString();
  f.close();

