sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
  int th = -1, tm = -1, ts = -1, tsync = -1, ty = 2026, tmon = 1, td = 1, twd = 3, fileVersion = 1;
  unsigned long tseq = 0;
  int parsed;
  if (val.startsWith("V")) {
    parsed = sscanf(val.c_str(), "V%d:%d:%d:%d:%d:%lu:%d:%d:%d:%d", &fileVersion, &th, &tm, &ts, &tsync, &tseq, &ty, &tmon, &td, &twd);
  } else {
    parsed = sscanf(val.c_str(), "%d:%d:%d:%d:%lu:%d:%d:%d:%d", &th, &tm, &ts, &tsync, &tseq, &ty, &tmon, &td, &twd);
  }

  // بررسی صحت مقادیر خوانده شده تا در صورت خراب شدن فایل (نوشتن ناقص هنگام قطع برق) استفاده نشود
  if (parsed < 4 || th < 0 || th > 23 || tm < 0 || tm > 59 || ts < 0 || ts > 59 || (tsync != 0 && tsync != 1)) {
    return false;
  }

  if ((fileVersion >= 2 || parsed >= 9) && (ty < 2024 || tmon < 1 || tmon > 12 || td < 1 || td > 31 || twd < 0 || twd > 6)) return false;
  h = th; m = tm; s = ts; sync = tsync; y = ty; mon = tmon; d = td; wd = twd;
  seq = ((fileVersion >= 2 && parsed >= 10) || (fileVersion == 1 && parsed >= 9)) ? tseq : 0; // فایل‌های قدیمیِ بدون تاریخ باید دوباره همگام‌سازی شوند
  return true;
}

// بارگذاری آخرین زمان معتبر ذخیره شده، بدون توجه به دلیل ریست شدن برد
// به این ترتیب یک نوسان یا قطعی کوتاه برق، ساعت را کاملاً پاک نمی‌کند و همگام‌سازی مجدد با گوشی لازم نیست
void loadTimeSetting() {
  int h0, m0, s0, sync0, y0, mon0, d0, wd0; unsigned long seq0;
  int h1, m1, s1, sync1, y1, mon1, d1, wd1; unsigned long seq1;

  bool ok0 = readTimeFile(TIME_FILES[0], h0, m0, s0, sync0, seq0, y0, mon0, d0, wd0);
  bool ok1 = readTimeFile(TIME_FILES[1], h1, m1, s1, sync1, seq1, y1, mon1, d1, wd1);

  bool useSlot0 = false, useSlot1 = false;

  if (ok0 && ok1) {
    // هر دو فایل معتبرند: جدیدترین را بر اساس شماره توالی انتخاب کن
    if (seq1 >= seq0) useSlot1 = true; else useSlot0 = true;
  } else if (ok0) {
    useSlot0 = true;
  } else if (ok1) {
    useSlot1 = true;
  }

  if (useSlot0) {
    currentHour = h0; currentMinute = m0; currentSecond = s0; currentYear = y0; currentMonth = mon0; currentDay = d0; currentWeekday = wd0;
    time_synchronized = (sync0 == 1 && seq0 > 0); // فایل قدیمیِ بدون تاریخ باید دوباره همگام‌سازی شود
    timeFileSlot = 0;
    timeSaveSeq = seq0;
  } else if (useSlot1) {
    currentHour = h1; currentMinute = m1; currentSecond = s1; currentYear = y1; currentMonth = mon1; currentDay = d1; currentWeekday = wd1;
    time_synchronized = (sync1 == 1 && seq1 > 0); // فایل قدیمیِ بدون تاریخ باید دوباره همگام‌سازی شود
    timeFileSlot = 1;
    timeSaveSeq = seq1;
  } else {
    // هیچ رکورد معتبری پیدا نشد (اولین راه‌اندازی برد یا خرابی کامل هر دو فایل)
    currentHour = 0;
    currentMinute = 0;
    currentSecond = 0;
    time_synchronized = false;
  }
}

// نوشتن آمار سوییچ/مدت‌کارکرد رله روی یکی از دو فایل به نوبت (Round-Robin)، دقیقاً مشابه ذخیره‌سازی ساعت،
// تا در صورت قطع برق درست وسط نوشتن، نسخه‌ی فایل دیگر سالم و قابل استفاده باقی بماند.
void saveRelayStats() {
  relayStatSaveSeq++;
  relayStatFileSlot = 1 - relayStatFileSlot;

  File f = LittleFS.open(RELAY_STAT_FILES[relayStatFileSlot], "w");
  if (f) {
    size_t written = f.printf("V%d:%lu:%lu:%lu", RELAY_STAT_FILE_VERSION, relaySwitchCount, relayTotalOnSeconds, relayStatSaveSeq);
    f.close();
    if (written == 0) {
      Serial.println("saveRelayStats write failed!");
      LittleFS.remove(RELAY_STAT_FILES[relayStatFileSlot]);
    }
  }
  lastRelayStatSaveMillis = millis();
}

// بارگذاری آخرین دریافت موفق ساعت از اینترنت (NTP) از فلش.
void loadNtpSuccessInfo() {
  ntpLastSuccessValid = false;
  if (!LittleFS.exists(NTP_META_FILE)) return;
  File f = LittleFS.open(NTP_META_FILE, "r");
  if (!f) return;

  StaticJsonDocument<192> doc;
  DeserializationError err = deserializeJson(doc, f);
  f.close();
  if (err) return;

  int y   = doc["y"]   | 0;
  int mon = doc["mon"] | 0;
  int d   = doc["d"]   | 0;
  int h   = doc["h"]   | -1;
  int m   = doc["m"]   | -1;
  int s   = doc["s"]   | -1;

  if (y < 2024 || mon < 1 || mon > 12 || d < 1 || d > 31 || h < 0 || h > 23 || m < 0 || m > 59 || s < 0 || s > 59) return;

  ntpLastSuccessYear = y;
  ntpLastSuccessMonth = mon;
  ntpLastSuccessDay = d;
  ntpLastSuccessHour = h;
  ntpLastSuccessMinute = m;
  ntpLastSuccessSecond = s;
  ntpLastSuccessValid = true;
  ntpEverSucceeded = true;
}

// ذخیره آخرین دریافت موفق ساعت از اینترنت به‌صورت تاریخ/ساعت مطلق؛ آخرین تلاش ناموفق اصلاً ذخیره نمی‌شود.
void saveNtpSuccessInfo() {
  if (!ntpLastSuccessValid) return;

  StaticJsonDocument<192> doc;
  doc["version"] = NTP_META_FILE_VERSION;
  doc["y"] = ntpLastSuccessYear;
  doc["mon"] = ntpLastSuccessMonth;
  doc["d"] = ntpLastSuccessDay;
  doc["h"] = ntpLastSuccessHour;
  doc["m"] = ntpLastSuccessMinute;
  doc["s"] = ntpLastSuccessSecond;

  File f = LittleFS.open(NTP_META_FILE, "w");
  if (!f) return;
  size_t written = serializeJson(doc, f);
  f.close();
  if (written == 0) {
    Serial.println("saveNtpSuccessInfo write failed!");
    LittleFS.remove(NTP_META_FILE);
  }
}

// محاسبه امن مدت دوره جاری روشن بودن رله.
// اگر relayOnSinceMillis به هر دلیل خراب/صفر باشد یا فاصله غیرمنطقی شود، از اضافه شدن عدد پرت جلوگیری می‌کنیم.
unsigned long relayCurrentPeriodElapsedSeconds() {
  if (!relayCurrentlyOnForStats) return 0;
  if (relayOnSinceMillis == 0) {
    Serial.println("Relay stats warning: relayOnSinceMillis was zero; re-anchoring.");
    relayOnSinceMillis = millis();
    return 0;
  }

  unsigned long elapsedSec = (millis() - relayOnSinceMillis) / 1000UL;
  if (elapsedSec > MAX_RELAY_OPEN_PERIOD_SECONDS) {
    Serial.print("Relay stats warning: unrealistic open period ignored: ");
    Serial.println(elapsedSec);
    relayOnSinceMillis = millis();
    return 0;
  }
  return elapsedSec;
}

// اضافه کردن امن به مجموع کارکرد موتور بدون overflow و بدون عبور از سقف sanity.
void addRelayOnSecondsSafely(unsigned long secondsToAdd) {
  if (secondsToAdd == 0) return;
  if (relayTotalOnSeconds > MAX_RELAY_ON_SECONDS) {
    Serial.println("Relay stats warning: stored onSeconds was unrealistic; resetting to 0.");
    relayTotalOnSeconds = 0;
  }
  if (secondsToAdd > (MAX_RELAY_ON_SECONDS - relayTotalOnSeconds)) {
    Serial.println("Relay stats warning: onSeconds overflow/unrealistic add blocked.");
    relayTotalOnSeconds = MAX_RELAY_ON_SECONDS;
  } else {
    relayTotalOnSeconds += secondsToAdd;
  }
}

// خواندن و اعتبارسنجی یکی از دو فایل آمار رله
bool readRelayStatFile(const char* path, unsigned long &sc, unsigned long &tos, unsigned long &seq) {
  if (!LittleFS.exists(path)) return false;

  File f = LittleFS.open(path, "r");
  if (!f) return false;

  String val = f.readString();
  f.close();

  unsigned long tsc = 0, ttos = 0, tseq = 0;
  int fileVersion = 1;
  int parsed = val.startsWith("V") ? sscanf(val.c_str(), "V%d:%lu:%lu:%lu", &fileVersion, &tsc, &ttos, &tseq) : sscanf(val.c_str(), "%lu:%lu:%lu", &tsc, &ttos, &tseq);
  if (parsed != (val.startsWith("V") ? 4 : 3)) return false; // نوشتن ناقص هنگام قطع برق؛ این رکورد نامعتبر است
  if (tsc > MAX_RELAY_SWITCH_COUNT || ttos > MAX_RELAY_ON_SECONDS) {
    Serial.print("Invalid relay stats ignored from ");
    Serial.println(path);
    return false;
  }

