sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
  JsonArray arr = doc.createNestedArray("scenarios");
  for (int i = 0; i < MAX_SCENARIOS; i++) {
    if (!scenarios[i].active) continue;
    JsonObject obj = arr.createNestedObject();
    obj["sh"] = scenarios[i].startHour;
    obj["sm"] = scenarios[i].startMinute;
    obj["eh"] = scenarios[i].endHour;
    obj["em"] = scenarios[i].endMinute;
    obj["en"] = scenarios[i].enabled;
    obj["wd"] = scenarios[i].weekdays;
  }

  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(200, "application/json", out);
}

void handleSaveScenario() {
  if (!allowRequest(lastSaveScenarioRequest, 1200UL)) return;

  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  if (!parseJsonBody(doc)) return;
  if (!doc.is<JsonArray>()) {
    sendJsonMessage(400, "error", "Expected JSON array");
    return;
  }

  JsonArray array = doc.as<JsonArray>();
  if (array.size() > MAX_SCENARIOS) {
    sendJsonMessage(400, "error", "Too many scenarios");
    return;
  }

  Scenario temp[MAX_SCENARIOS] = {};
  int i = 0;
  for (JsonObject v : array) {
    int sh = v["sh"] | -1;
    int sm = v["sm"] | -1;
    int eh = v["eh"] | -1;
    int em = v["em"] | -1;
    int wd = v.containsKey("wd") ? (int)(v["wd"] | 0x7F) : 0x7F;

    if (sh < 0 || sh > 23 || eh < 0 || eh > 23 || sm < 0 || sm > 59 || em < 0 || em > 59) {
      sendJsonMessage(400, "error", "Invalid scenario time range");
      return;
    }
    if (sh == eh && sm == em) {
      sendJsonMessage(400, "error", "Scenario start and end cannot be equal");
      return;
    }
    if (wd < 1 || wd > 127) {
      sendJsonMessage(400, "error", "Invalid weekday mask");
      return;
    }

    temp[i].active = true;
    temp[i].enabled = v["en"] | true;
    temp[i].startHour = sh;
    temp[i].startMinute = sm;
    temp[i].endHour = eh;
    temp[i].endMinute = em;
    temp[i].weekdays = (uint8_t)wd;
    i++;
  }

  bool isChanged = false;
  for (int j = 0; j < MAX_SCENARIOS; j++) {
    if (scenarios[j].active != temp[j].active ||
        scenarios[j].enabled != temp[j].enabled ||
        scenarios[j].startHour != temp[j].startHour ||
        scenarios[j].startMinute != temp[j].startMinute ||
        scenarios[j].endHour != temp[j].endHour ||
        scenarios[j].endMinute != temp[j].endMinute ||
        scenarios[j].weekdays != temp[j].weekdays) {
      isChanged = true;
      break;
    }
  }

  if (isChanged) {
    for (int j = 0; j < MAX_SCENARIOS; j++) scenarios[j] = temp[j];
    saveScenarios();
  }

  sendJsonMessage(200, "success", isChanged ? "Scenarios saved" : "No changes");
}

void handleSyncTime() {
  if (!allowRequest(lastSyncRequest, 1000UL)) return;

  StaticJsonDocument<256> doc;
  if (!parseJsonBody(doc)) return;

  int h = doc["h"] | -1;
  int m = doc["m"] | -1;
  int s = doc["s"] | -1;
  int y = doc["y"] | 0;
  int mon = doc["mon"] | 0;
  int d = doc["d"] | 0;
  int wd = doc["wd"] | -1;

  if (h < 0 || h > 23 || m < 0 || m > 59 || s < 0 || s > 59 ||
      y < 2024 || mon < 1 || mon > 12 || d < 1 || d > 31 || wd < 0 || wd > 6) {
    sendJsonMessage(400, "error", "Invalid time range");
    return;
  }

  currentHour = h;
  currentMinute = m;
  currentSecond = s;
  currentYear = y;
  currentMonth = mon;
  currentDay = d;
  currentWeekday = wd;
  lastTick = millis();
  time_synchronized = true;
  saveTimeSetting();

  sendJsonMessage(200, "success", "Time synchronized");
}

void handleGetStatus() {
  // پنل هر ۱ ثانیه درخواست می‌دهد؛ حد ۱۵۰ms فقط اسپم غیرعادی را رد می‌کند.
  if (!allowRequest(lastStatusRequest, 150UL)) return;

  char timeStr[9];
  sprintf(timeStr, "%02d:%02d:%02d", currentHour, currentMinute, currentSecond);

  int logicalState = (digitalRead(RELAY_PIN) == RELAY_ACTIVE_LEVEL) ? 1 : 0;
  int staConnected = (WiFi.status() == WL_CONNECTED) ? 1 : 0;
  int staConfigured = (strlen(sta_ssid) > 0) ? 1 : 0;
  char staIp[16] = "";
  if (staConnected) {
    IPAddress ip = WiFi.localIP();
    snprintf(staIp, sizeof(staIp), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
  }

  int staState;
  if (!internet_enabled || !staConfigured) {
    staState = 0;
  } else if (staOffMinutes > 0 && !staCurrentlyOn) {
    staState = 4;
  } else if (staConnected) {
    staEverConnectedThisBoot = true;
    staState = 2;
  } else if (staEverConnectedThisBoot) {
    staState = 3;
  } else {
    staState = 1;
  }

  unsigned long liveOnSeconds = relayTotalOnSeconds;
  if (relayCurrentlyOnForStats) {
    unsigned long elapsed = relayCurrentPeriodElapsedSeconds();
    if (elapsed <= (MAX_RELAY_ON_SECONDS - liveOnSeconds)) liveOnSeconds += elapsed;
  }

  long protectionRemainingSec = 0;
  if (antiShortCycleMinutes > 0 && lastRelayStatState == 0) {
    unsigned long requiredMs = (unsigned long)antiShortCycleMinutes * 60UL * 1000UL;
    unsigned long elapsed = millis() - lastRelayOffMillis;
    if (elapsed < requiredMs) protectionRemainingSec = (long)((requiredMs - elapsed + 999UL) / 1000UL);
  }

  int apStationCount = apCurrentlyOn ? WiFi.softAPgetStationNum() : 0;
  long apRemainingSec = 0;
  if (apCycleEnabled) {
    unsigned long phaseMs = apCurrentlyOn ? ((unsigned long)apOnMinutes * 60000UL) : ((unsigned long)apOffMinutes * 60000UL);
    unsigned long elapsed = millis() - apCycleLastToggleMillis;
    if (elapsed < phaseMs) apRemainingSec = (long)((phaseMs - elapsed + 999UL) / 1000UL);
  }

  long staRemainingSec = 0;
  if (internet_enabled && staConfigured && staOffMinutes > 0) {
    unsigned long phaseMs = staCurrentlyOn ? ((unsigned long)staOnMinutes * 60000UL) : ((unsigned long)staOffMinutes * 60000UL);
    unsigned long elapsed = millis() - staCycleLastToggleMillis;
    if (elapsed < phaseMs) staRemainingSec = (long)((phaseMs - elapsed + 999UL) / 1000UL);
  }

  DynamicJsonDocument doc(2048);
  doc["status"] = "success";
  doc["time"] = timeStr;
  doc["relay"] = logicalState;
  doc["override"] = manual_override;
  doc["sync"] = time_synchronized ? 1 : 0;
  doc["sta"] = staConnected;
  doc["internetEnabled"] = internet_enabled ? 1 : 0;
  doc["staConfigured"] = staConfigured;
  doc["staState"] = staState;
  doc["staIp"] = staIp;
  doc["staOnMinutes"] = staOnMinutes;
  doc["staOffMinutes"] = staOffMinutes;
  doc["staPhaseOn"] = staCurrentlyOn ? 1 : 0;
  doc["staRemaining"] = staRemainingSec;
  doc["ntpOk"] = ntpEverSucceeded ? 1 : 0;
  doc["ntpLastValid"] = ntpLastSuccessValid ? 1 : 0;
  doc["ntpYear"] = ntpLastSuccessYear;
  doc["ntpMonth"] = ntpLastSuccessMonth;
  doc["ntpDay"] = ntpLastSuccessDay;
  doc["ntpHour"] = ntpLastSuccessHour;
  doc["ntpMinute"] = ntpLastSuccessMinute;
  doc["ntpSecond"] = ntpLastSuccessSecond;
  doc["switchCount"] = relaySwitchCount;
  doc["onSeconds"] = liveOnSeconds;
  doc["weekday"] = currentWeekday;
  doc["year"] = currentYear;
  doc["month"] = currentMonth;
  doc["day"] = currentDay;
  doc["protectionMinutes"] = antiShortCycleMinutes;
  doc["protectionRemaining"] = protectionRemainingSec;
  doc["apCycleEnabled"] = apCycleEnabled ? 1 : 0;
  doc["apOn"] = apCurrentlyOn ? 1 : 0;
  doc["apOnMinutes"] = apOnMinutes;
  doc["apOffMinutes"] = apOffMinutes;
  doc["apTxPowerLevel"] = apTxPowerLevel;
  doc["apRemaining"] = apRemainingSec;
  doc["apClientConnected"] = (apStationCount > 0) ? 1 : 0;
  doc["freeHeap"] = ESP.getFreeHeap();

  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(200, "application/json", out);
}

void handleToggleManual() {
  if (!allowRequest(lastToggleManualRequest, 1500UL)) return;

  // برای یک API JSON خالص، body لازم نیست. اگر body ارسال شود، فقط معتبر بودن JSON چک می‌شود.
  if (server.hasArg("plain") && server.arg("plain").length() > 0) {
    StaticJsonDocument<64> ignored;
    if (!parseJsonBody(ignored)) return;
  }

  if (manual_override == 0) {
    manual_override = 1;
    saveOverrideSetting();
    if (time_synchronized) saveTimeSetting();
    delay(100);
    checkScenarios();
  } else {
    manual_override = 0;
    saveOverrideSetting();
    if (time_synchronized) saveTimeSetting();
    delay(100);
    checkScenarios();
  }

