sargoliwork101-ui/cooler_app14050504/esp_multiboard/Cooler_ESP_API_ESP32_ESP8266.ino
  StaticJsonDocument<160> doc;
  doc["status"] = "success";
  doc["override"] = manual_override;
  doc["relay"] = (digitalRead(RELAY_PIN) == RELAY_ACTIVE_LEVEL) ? 1 : 0;
  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(200, "application/json", out);
}

void handleSaveAP() {
  if (!allowRequest(lastSaveApRequest, 3000UL)) return;

  StaticJsonDocument<256> doc;
  if (!parseJsonBody(doc)) return;

  const char* newSsid = doc["ssid"] | "";
  const char* newPass = doc["pass"] | "";
  String ssidStr = String(newSsid);
  String passStr = String(newPass);

  if (ssidStr.length() == 0 || ssidStr.length() > 31 || passStr.length() < 8 || passStr.length() > 31) {
    sendJsonMessage(400, "error", "Invalid AP SSID or password length");
    return;
  }

  ssidStr.toCharArray(custom_ssid, sizeof(custom_ssid));
  passStr.toCharArray(custom_password, sizeof(custom_password));
  saveWiFiSettings();
  saveTimeSetting();

  sendJsonMessage(200, "success", "AP settings saved; ESP32 will restart");
  pendingReset = true;
  resetMillis = millis();
}

void handleSaveSTA() {
  if (!allowRequest(lastSaveStaRequest, 1500UL)) return;

  StaticJsonDocument<512> doc;
  if (!parseJsonBody(doc)) return;

  String newStaSsid = String((const char*)(doc["sta_ssid"] | ""));
  String newStaPass = String((const char*)(doc["sta_pass"] | ""));
  bool newInternet = doc["internet"] | false;
  int onVal = doc["sta_on_minutes"] | -1;
  int offVal = doc["sta_off_minutes"] | -1;

  if (newStaSsid.length() > 31 || newStaPass.length() > 63) {
    sendJsonMessage(400, "error", "SSID or password too long");
    return;
  }
  if (newStaPass.length() > 0 && newStaPass.length() < 8) {
    sendJsonMessage(400, "error", "STA password must be empty or at least 8 characters");
    return;
  }
  if (onVal < MIN_STA_ON_MINUTES || onVal > MAX_STA_CYCLE_MINUTES || offVal < MIN_STA_OFF_MINUTES || offVal > MAX_STA_CYCLE_MINUTES) {
    sendJsonMessage(400, "error", "Invalid STA cycle minutes");
    return;
  }

  internet_enabled = newInternet;
  staOnMinutes = onVal;
  staOffMinutes = offVal;
  newStaSsid.toCharArray(sta_ssid, sizeof(sta_ssid));
  newStaPass.toCharArray(sta_password, sizeof(sta_password));
  saveWiFiSettings();

  ntp_synced_this_boot = false;
  ntpFirstCheckPending = true;
  lastNtpCheckMillis = 0;
  staEverConnectedThisBoot = false;

  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false);
  staCurrentlyOn = true;
  staCycleLastToggleMillis = millis();
  connectToInternetWiFi();

  sendJsonMessage(200, "success", "STA settings saved");
}

void handleSaveProtection() {
  if (!allowRequest(lastSaveProtectionRequest, 1000UL)) return;

  StaticJsonDocument<128> doc;
  if (!parseJsonBody(doc)) return;

  int value = doc["min_off"] | -1;
  if (value < 0 || value > MAX_ANTI_SHORT_CYCLE_MINUTES) {
    sendJsonMessage(400, "error", "Invalid protection minutes");
    return;
  }

  antiShortCycleMinutes = value;
  saveProtectionSettings();
  sendJsonMessage(200, "success", "Protection settings saved");
}

void handleFactoryReset() {
  if (!allowRequest(lastFactoryResetRequest, 5000UL)) return;

  StaticJsonDocument<128> doc;
  if (!parseJsonBody(doc)) return;

  const char* code = doc["code"] | doc["password"] | "";
  if (String(code) != String(FACTORY_RESET_CODE)) {
    sendJsonMessage(403, "error", "Invalid reset code");
    return;
  }

  // برای ایمنی، قبل از ریست کامل حافظه رله خاموش و حالت دستی پاک می‌شود.
  manual_override = 0;
  setRelay(false);
  relayCurrentlyOnForStats = false;

  // ریست کامل حافظه فایل‌سیستم: سناریوها، زمان، آمار، تنظیمات WiFi، محافظت، override و NTP meta.
  bool ok = LittleFS.format();
  if (!ok) {
    sendJsonMessage(500, "error", "LittleFS format failed");
    return;
  }

  sendJsonMessage(200, "success", "Factory reset done; restarting");

  // مهم: در loop قبل از ریست دیگر saveTimeSetting انجام نشود، وگرنه پس از format دوباره فایل زمان ساخته می‌شود.
  pendingFactoryReset = true;
  pendingReset = true;
  resetMillis = millis();
}

void handleSaveApCycle() {
  if (!allowRequest(lastSaveApCycleRequest, 1000UL)) return;

  StaticJsonDocument<256> doc;
  if (!parseJsonBody(doc)) return;

  bool enabled = doc["cycle_enabled"] | false;
  int onVal = doc["on_minutes"] | -1;
  int offVal = doc["off_minutes"] | -1;
  int powerVal = doc["tx_power"] | -1;

  if (onVal < MIN_AP_CYCLE_MINUTES || onVal > MAX_AP_CYCLE_MINUTES ||
      offVal < MIN_AP_CYCLE_MINUTES || offVal > MAX_AP_CYCLE_MINUTES ||
      powerVal < 0 || powerVal > MAX_AP_TX_POWER_LEVEL) {
    sendJsonMessage(400, "error", "Invalid AP cycle or TX power value");
    return;
  }

  apCycleEnabled = enabled;
  apOnMinutes = onVal;
  apOffMinutes = offVal;
  apTxPowerLevel = powerVal;
  applyApTxPower();

  apCycleLastToggleMillis = millis();
  if (!apCurrentlyOn) setApRadioState(true);

  saveWiFiSettings();
  sendJsonMessage(200, "success", "AP cycle settings saved");
}
